__files/req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:inq="http://inquiry.service.dda.appx.cz.fc.ofss.com/" xmlns:con="http://context.app.fc.ofss.com" xmlns:exc="http://exception.infra.fc.ofss.com" xmlns:dat="http://datatype.fc.ofss.com" xmlns:dto="http://dto.common.domain.framework.fc.ofss.com" xmlns:dom="http://domain.framework.fc.ofss.com">
    <soapenv:Header/>
    <soapenv:Body>
        <inq:fetchAccountSummary>
            <arg0>
                <con:bankCode>08</con:bankCode>
                <con:channel>BB11</con:channel>
                <con:transactionBranch>089999</con:transactionBranch>
                <con:externalReferenceNo>1101201905</con:externalReferenceNo>
                <con:userId>DevUser01</con:userId>
                <con:transactingPartyCode>50000010</con:transactingPartyCode>
            </arg0>
            <arg1>
                <customerId>50236368</customerId>
            </arg1>
        </inq:fetchAccountSummary>
    </soapenv:Body>
</soapenv:Envelope>